app/Models/CongeModel.php

    public function getAllWithDetails(): array
    {
        return $this->select('conges.*,
                              employes.nom AS employe_nom,
                              employes.prenom AS employe_prenom,
                              departements.nom AS departement_nom,
                              types_conge.libelle AS type_libelle,
                              rh.nom AS rh_nom,
                              rh.prenom AS rh_prenom')
                    ->join('employes',    'employes.id = conges.employe_id',       'left')
                    ->join('departements','departements.id = employes.departement_id', 'left')
                    ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
                    ->join('employes rh', 'rh.id = conges.traite_par',             'left')
                    ->orderBy('conges.created_at', 'DESC')
                    ->findAll();
---
SELECT `conges`.*, `employes`.`nom` AS `employe_nom`, `employes`.`prenom` AS `employe_prenom`, `employes`.`date_embauche` AS `date_embauche`, `departements`.`nom` AS `departement_nom`, `types_conge`.`libelle` AS `type_libelle`, `rh`.`nom` AS `rh_nom`, `rh`.`prenom` AS `rh_prenom`
FROM `conges`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
LEFT JOIN `employes` `rh` ON `rh`.`id` = `conges`.`traite_par`
ORDER BY `conges`.`created_at` DESC