app/Models/DemandeModel.php

    public function getDemandesWithDetails()
    {
        return $this->select('conges.*, employes.nom, employes.prenom, employes.email, types_conge.libelle as type_conge')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->findAll();
---
SELECT `demande`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle` as `type_conge`, `statut`.`libelle` as `statut`
FROM `demande`
JOIN `employes` ON `employes`.`id` = `demande`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `demande`.`type_id`
JOIN `statut` ON `statut`.`id` = `demande`.`statut_id`

    public function createDemande($data)
    {
        return $this->insert($data);
---
INSERT INTO `demande` (`employe_id`, `type_id`, `statut_id`, `date_debut`, `date_fin`, `motif`) VALUES (4, 1, 1, '2025-06-23', '2025-06-27', 's')