app/Models/EmployesModel.php

SELECT *
FROM `employes`
WHERE `email` = 'admin@techmada.mg'
 LIMIT 1
---
    public function getByEmail(string $email)
    {
        return $this->asArray()->where('email', $email)->first();

SELECT `employes`.*, `departements`.`nom` AS `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `employes`.`id` = 1
 LIMIT 1
---
    public function getByIdWithDetails(int $id)
    {
        return $this->select('employes.*, departements.nom AS departement_nom')
                    ->join('departements', 'departements.id = employes.departement_id', 'left')
                    ->where('employes.id', $id)
                    ->first();