app/Models/SoldeModel.php

SELECT *
FROM `soldes`
WHERE `employe_id` = 1
AND `type_conge_id` = 1
AND `annee` = 2026
 LIMIT 1
---
    public function getSolde(int $employeId, int $typeCongeId, int $annee)
    {
        $solde = $this->where('employe_id', $employeId)
                      ->where('type_conge_id', $typeCongeId)
                      ->where('annee', $annee)
                      ->first();